package com.trojx.jav;

import android.app.Application;
import android.test.ApplicationTestCase;
import android.util.Log;

import com.avos.avoscloud.AVException;
import com.avos.avoscloud.AVObject;
import com.avos.avoscloud.SaveCallback;

/**
 * <a href="http://d.android.com/tools/testing/testing_android.html">Testing Fundamentals</a>
 */
public class ApplicationTest extends ApplicationTestCase<Application> {
    public ApplicationTest() {
        super(Application.class);
        String[] s={"企画","女同性恋","猎艳","野外?露出","偶像艺人","其他恋物癖","乱伦","恋乳癖","情侣","男同性恋","花痴","偷窥","恋腿癖","性骚扰","倒追","性奴","跳舞","双性人","姐妹","通奸","粗暴","学校作品","恶作剧","妄想","残忍画面","烂醉如泥的","处女","美容院","性感的","女同接吻","运动","瘙痒","出轨","正太控","处男","蛮横娇羞","触手","呕吐","折磨","温泉","原作コラボ","巨大阳具","ファン感謝?訪問","ハーレム","早漏","キス?接吻","流汗","アニメ","アクション","服务生",
                "高中女生","女主播","女生","黑人演员","荡妇","护士","家教","母亲","女教师","展场女孩","女大学生","赛车女郎","妓女","各种职业","女医生","已婚妇女","白人","千金小姐","寡妇","车掌小姐","格斗家","姐姐","新娘、年轻妻子","美少女","秘书","模特儿","女主人、女老板","明星脸","女检察官","格斗家","婆婆","讲师","伴侣","亚洲女演员","公主","童年朋友","黑帮成员","受虐男","角色扮演","眼镜","泳装","校服","迷你裙","女佣","旗袍","学校泳装","水手服","内衣","体育服","和服?丧服",
                "OL","身体意识","连裤袜","空中小姐","迷你裙警察","裸体围裙","紧身衣","制服","泡泡袜","女祭司","猫耳女","兔女郎","猥亵穿着","内衣","女装人妖","女忍者","娃娃","及膝袜","女战士","制服","角色扮演","巨乳","贫乳?微乳","萝莉塔","熟女","孕妇","苗条","胖女人","无毛","变性者","高","屁股","娇小的","乳房","肌肉","超乳","大屁股","晒黑","中出","颜射","自慰","颜射","肛交","吞精","打手枪","放尿","滥交","口交","饮尿","排便","乳交","潮吹","淫语","69","深喉","拳交","舔阴",
                "女上位","按摩","手指插入","母乳","足交","食粪","颜面骑乘","肛内中出","多P","按摩棒","紧缚","跳蛋","玩具","粪便","SM","汽车性爱","药物","强奸","紧缚","监禁","灌肠","鸭嘴","插入异物","轮奸","拘束","凌辱","羞耻","乳液","催眠","子宫颈","女优按摩棒","立即口交","合集","单体作品","DMM独家","独立制作","局部特写","业余","第一人称摄影","国外进口","纪录片","投稿","其他","数位马赛克","首次亮相","经典","薄马赛克","4小时以上作品","介绍影片","主观视角","高画质","恋爱",
                "戏剧","复刻版","限时降价","故事集","特效","3D","戏剧","R-18","R-15","DMM专属","教学","给女性观众","恐怖","合作作品","10枚組","女優ベスト?総集編","16時間以上作品","動画","スマホ推奨縦動画","Vシネマ"};
        for(int i=0;i<s.length-1;i++){
            AVObject item=new AVObject("Tag");
            item.put("name",s[i]);
            item.put("hot",0);
            item.saveInBackground(new SaveCallback() {
                @Override
                public void done(AVException e) {
                    if(e!=null){
                        Log.e("tag error",e.toString());
                    }
                }
            });
        }
    }
}